MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.h
/**
  **********************************************************************************************************************
  * @file    stm32c5xx_hal_pka.h
  * @brief   Header file of PKA HAL module.
  **********************************************************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  **********************************************************************************************************************
  */
/* Define to prevent recursive inclusion -----------------------------------------------------------------------------*/
#ifndef STM32C5XX_HAL_PKA_H
#define STM32C5XX_HAL_PKA_H

#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

/* Includes ----------------------------------------------------------------------------------------------------------*/
#include "stm32c5xx_hal_def.h"
#include "stm32c5xx_ll_pka.h"
#include "stm32c5xx_ll_rng.h"

/** @addtogroup STM32C5xx_HAL_Driver
  * @{
  */
#if defined(PKA)

/** @defgroup PKA PKA
  * @{
  */

/* Exported constants ------------------------------------------------------------------------------------------------*/
/** @defgroup PKA_Exported_Constants HAL PKA Constants
  * @{
  */

/** @defgroup PKA_Error_Code_definition PKA Error Code definition
  * @{
  */
#define HAL_PKA_ERROR_NONE      0x00U               /*!< PKA error code: none */
#define HAL_PKA_ERROR_RESULT    0x01U               /*!< PKA result error    */
#define HAL_PKA_ERROR_ADDRERR   LL_PKA_FLAG_ADDRERR /*!< PKA address error   */
#define HAL_PKA_ERROR_RAMERR    LL_PKA_FLAG_RAMERR  /*!< PKA RAM error       */
#define HAL_PKA_ERROR_OPERATION LL_PKA_FLAG_OPERR   /*!< PKA operation error */
/**
  * @}
  */

/**
  * @}
  */

/* Exported types ----------------------------------------------------------------------------------------------------*/
/** @defgroup PKA_Exported_Types HAL PKA Types
  * @{
  */

/**
  * @brief PKA instance enumeration definition
  */
typedef enum
{
  HAL_PKA1 = PKA_BASE  /*!< HAL PKA instance */
} hal_pka_t;

/**
  * @brief PKA state enumeration definition
  */
typedef enum
{
  HAL_PKA_STATE_RESET  = 0U,           /*!< PKA not yet initialized or disabled       */
  HAL_PKA_STATE_INIT   = (1UL << 31U), /*!< PKA is initialized but not yet configured */
  HAL_PKA_STATE_IDLE   = (1UL << 30U), /*!< PKA is initialized and configured         */
  HAL_PKA_STATE_ACTIVE = (1UL << 29U)  /*!< PKA internal processing is ongoing        */
} hal_pka_state_t;

/**
  * @brief PKA RSA signature state
  */
typedef enum
{
  PKA_RSA_SIGNATURE_NOT_VALID = 0U, /*!< The RSA signature is not valid */
  PKA_RSA_SIGNATURE_VALID     = 1U  /*!< The RSA signature is valid     */
} hal_pka_rsa_signature_status_t;

/**
  * @brief PKA ECDSA signature state
  */
typedef enum
{
  PKA_ECDSA_SIGNATURE_NOT_VALID = 0U, /*!< The ECDSA signature is not valid */
  PKA_ECDSA_SIGNATURE_VALID     = 1U  /*!< The ECDSA signature is valid     */
} hal_pka_ecdsa_signature_status_t;

/**
  * @brief PKA ECC point state
  */
typedef enum
{
  PKA_ECC_POINT_NOT_ON_CURVE = 0U, /*!< The ECC point is not on the curve */
  PKA_ECC_POINT_ON_CURVE     = 1U  /*!< The ECC point is on the curve     */
} hal_pka_ecc_point_status_t;


/**
  * @brief PKA ECC scalar multiplication protected configuration structure definition
  */
typedef struct
{
  uint32_t      prime_order_size_byte; /*!< Number of elements in p_prime_order array                                */
  uint32_t      scalar_mul_size_byte;  /*!< Number of elements in p_scalar_mul array                                 */
  uint32_t      modulus_size_byte;     /*!< Number of elements in p_modulus, p_coeff_a, p_pt_x and p_pt_y arrays     */
  uint32_t      coeff_sign;            /*!< Curve coefficient a sign                                                */
  const uint8_t *p_coeff_a;            /*!< Pointer to curve coefficient |a|                                        */
  const uint8_t *p_coeff_b;            /*!< Pointer to curve coefficient b                                          */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p (Array of modulus_size_byte elements)  */
  const uint8_t *p_pt_x;               /*!< Pointer to point P coordinate xP (Array of modulus_size_byte elements)  */
  const uint8_t *p_pt_y;               /*!< Pointer to point P coordinate yP (Array of modulus_size_byte elements)  */
  const uint8_t *p_scalar_mul;         /*!< Pointer to scalar multiplier k (Array of scalar_mul_size_byte elements) */
  const uint8_t *p_prime_order;        /*!< Pointer to curve prime order (Array of prime_order_size_byte elements)  */
} hal_pka_ecc_mul_protect_config_t;

/**
  * @brief PKA point-on-elliptic-curve check configuration structure definition
  */
typedef struct
{
  uint32_t      modulus_size_byte;   /*!< Number of elements in p_coeff_a, p_coeff_b, p_modulus, p_pt_x and p_pt_y
                                          arrays                                                                 */
  uint32_t      coeff_sign;          /*!< Curve coefficient a sign                                               */
  const uint8_t *p_montgomery_param; /*!< Pointer to Montgomery parameter (Array of modulus_size_byte)           */
  const uint8_t *p_coeff_a;          /*!< Pointer to curve coefficient |a| (Array of modulus_size_byte elements) */
  const uint8_t *p_coeff_b;          /*!< Pointer to curve coefficient b   (Array of modulus_size_byte elements) */
  const uint8_t *p_modulus;          /*!< Pointer to curve modulus value p (Array of modulus_size_byte elements) */
  const uint8_t *p_pt_x;             /*!< Pointer to point P coordinate xP (Array of modulus_size_byte elements) */
  const uint8_t *p_pt_y;             /*!< Pointer to point P coordinate yP (Array of modulus_size_byte elements) */
} hal_pka_point_check_config_t;

/**
  * @brief PKA RSA CRT exponentiation configuration structure definition
  */
typedef struct
{
  uint32_t      size_byte;       /*!< Number of elements in p_operand_a array                 */
  const uint8_t *p_operand_dp;   /*!< Pointer to operand dP (Array of size_byte/2 elements)   */
  const uint8_t *p_operand_dq;   /*!< Pointer to operand dQ (Array of size_byte/2 elements)   */
  const uint8_t *p_operand_qinv; /*!< Pointer to operand qinv (Array of size_byte/2 elements) */
  const uint8_t *p_prime_p;      /*!< Pointer to prime p (Array of size_byte/2 elements)      */
  const uint8_t *p_prime_q;      /*!< Pointer to prime Q (Array of size_byte/2 elements)      */
  const uint8_t *p_operand_a;    /*!< Pointer to operand A (Array of size_byte elements)      */
} hal_pka_rsa_crt_exp_config_t;

/**
  * @brief PKA RSA signature configuration structure definition
  */
typedef struct
{
  uint32_t      private_key_size_byte; /*!< Number of elements in p_private_key array                            */
  uint32_t      hash_size_byte;        /*!< Number of elements in p_hash array                                   */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p (Array of hash_size_byte elements) */
  const uint8_t *p_private_key;        /*!< Pointer to private key d (Array of private_key_size_byte elements)  */
  const uint8_t *p_hash;               /*!< Pointer to hash of the message (Array of hash_size_byte elements)   */
} hal_pka_rsa_signature_config_t;

/**
  * @brief PKA RSA signature fast configuration structure definition
  */
typedef struct
{
  uint32_t      private_key_size_byte; /*!< Number of elements in p_private_key array                             */
  uint32_t      hash_size_byte;        /*!< Number of elements in p_hash array                                    */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p (Array of hash_size_byte elements)   */
  const uint8_t *p_private_key;        /*!< Pointer to private key d (Array of private_key_size_byte elements)    */
  const uint8_t *p_hash;               /*!< Pointer to hash of the message (Array of hash_size_byte elements)     */
  const uint8_t *p_montgomery_param;   /*!< Pointer to Montgomery parameter (Array of exponent_size_byte elements)*/
} hal_pka_rsa_signature_fast_config_t;

/**
  * @brief PKA RSA signature protected configuration structure definition
  */
typedef struct
{
  uint32_t      private_key_size_byte; /*!< Number of elements in p_private_key array                           */
  uint32_t      hash_size_byte;        /*!< Number of elements in p_hash array                                  */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p (Array of hash_size_byte elements) */
  const uint8_t *p_private_key;        /*!< Pointer to private key d (Array of private_key_size_byte elements)  */
  const uint8_t *p_hash;               /*!< Pointer to hash of the message (Array of hash_size_byte elements)   */
  const uint8_t *p_phi;                /*!< Pointer to Phi value                                                */
} hal_pka_rsa_signature_protect_config_t;

/**
  * @brief PKA RSA verification configuration structure definition
  */
typedef struct
{
  uint32_t      public_key_size_byte; /*!< Number of elements in p_public_key array                            */
  uint32_t      sign_size_byte;       /*!< Number of elements in p_sign array                                  */
  const uint8_t *p_modulus;           /*!< Pointer to curve modulus value p (Array of sign_size_byte elements) */
  const uint8_t *p_public_key;        /*!< Pointer to public key d (Array of public_key_size_byte elements)    */
  const uint8_t *p_sign;              /*!< Pointer to RSA signature (Array of sign_size_byte elements)         */
} hal_pka_rsa_verif_config_t;

/**
  * @brief PKA elliptic curves over prime fields verification configuration structure definition
  */
typedef struct
{
  uint32_t      prime_order_size_byte; /*!< Number of elements in prime order array                                   */
  uint32_t      modulus_size_byte;     /*!< Number of elements in modulus array                                       */
  uint32_t      coeff_sign;            /*!< Curve coefficient a sign                                                  */
  const uint8_t *p_coeff;              /*!< Pointer to curve coefficient |a| (Array of modulus_size_byte elements)    */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p (Array of modulus_size_byte elements)    */
  const uint8_t *p_base_pt_x;          /*!< Pointer to curve base point xG (Array of modulus_size_byte elements)      */
  const uint8_t *p_base_pt_y;          /*!< Pointer to curve base point yG (Array of modulus_size_byte elements)      */
  const uint8_t *p_pub_key_curve_pt_x; /*!< Pointer to public key curve point xG (Array of modulus_size_byte elements) */
  const uint8_t *p_pub_key_curve_pt_y; /*!< Pointer to public key curve point yG (Array of modulus_size_byte elements) */
  const uint8_t *p_r_sign;             /*!< Pointer to signature part r (Array of prime_order_size_byte elements)     */
  const uint8_t *p_s_sign;             /*!< Pointer to signature part s (Array of prime_order_size_byte elements)     */
  const uint8_t *p_hash;               /*!< Pointer to hash of message z (Array of prime_order_size_byte elements)    */
  const uint8_t *p_prime_order;        /*!< Pointer to order of the curve n (Array of prime_order_size_byte elements) */
} hal_pka_ecdsa_verif_config_t;


/**
  * @brief PKA elliptic curves over prime fields signature configuration structure definition (protected mode).
  */
typedef struct
{
  uint32_t      prime_order_size_byte; /*!< Number of elements in p_prime_order array                              */
  uint32_t      modulus_size_byte;     /*!< Number of elements in p_modulus array                                  */
  uint32_t      coeff_sign;            /*!< Curve coefficient a sign                                               */
  const uint8_t *p_coeff;              /*!< Pointer to curve coefficient |a| (Array of modulus_size_byte elements) */
  const uint8_t *p_coeff_b;            /*!< Pointer to B coefficient (Array of modulus_size_byte elements)         */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p (Array of modulus_size_byte elements) */
  const uint8_t *p_integer;            /*!< Pointer to random integer k (Array of primeOrderSize elements)         */
  const uint8_t *p_base_pt_x;          /*!< Pointer to curve base point xG (Array of modulus_size_byte elements)   */
  const uint8_t *p_base_pt_y;          /*!< Pointer to curve base point yG (Array of modulus_size_byte elements)   */
  const uint8_t *p_hash;               /*!< Pointer to hash of the message (Array of primeOrderSize elements)      */
  const uint8_t *p_private_key;        /*!< Pointer to private key d (Array of primeOrderSize elements)            */
  const uint8_t *p_prime_order;        /*!< Pointer to order of the curve n (Array of primeOrderSize elements)     */
} hal_pka_ecdsa_signature_protect_config_t;


/**
  * @brief PKA elliptic curves over prime fields output structure definition (protected mode)
  */
typedef struct
{
  uint8_t *p_r_sign; /*!< Pointer to signature part r */
  uint8_t *p_s_sign; /*!< Pointer to signature part s */
} hal_pka_ecdsa_signature_protect_result_t;

/**
  * @brief PKA curve operations output structure definition
  */
typedef struct
{
  uint8_t *p_pt_x; /*!< Pointer to point P coordinate xP */
  uint8_t *p_pt_y; /*!< Pointer to point P coordinate yP */
} hal_pka_ecdsa_signature_result_ext_config_t;

typedef hal_pka_ecdsa_signature_result_ext_config_t hal_pka_ecc_projective_to_affine_result_t;
typedef hal_pka_ecdsa_signature_result_ext_config_t hal_pka_ecc_double_base_ladder_result_t;


