MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.h
typedef hal_pka_ecdsa_signature_result_ext_config_t hal_pka_ecc_mul_protect_result_t;

/**
  * @brief PKA Modular exponentiation configuration structure definition
  */
typedef struct
{
  uint32_t      exponent_size_byte; /*!< Number of elements in p_exponent array                     */
  uint32_t      operand_size_byte;  /*!< Number of elements in p_operand and pMod arrays            */
  const uint8_t *p_exponent;        /*!< Pointer to Exponent (Array of exponent_size_byte elements) */
  const uint8_t *p_operand;         /*!< Pointer to Operand (Array of operand_size_byte elements)   */
  const uint8_t *p_modulus;         /*!< Pointer to modulus (Array of operand_size_byte elements)   */
} hal_pka_mod_exp_config_t;

/**
  * @brief PKA Modular exponentiation protected configuration structure definition
  */
typedef struct
{
  uint32_t      exponent_size_byte; /*!< Size of the exponent in bytes                                    */
  uint32_t      operand_size_byte;  /*!< Size of the operand in bytes                                     */
  const uint8_t *p_operand;         /*!< Pointer to Operand (Array of exponent_size_byte elements)        */
  const uint8_t *p_exponent;        /*!< Pointer to Exponent (Array of operand_size_byte elements)        */
  const uint8_t *p_modulus;         /*!< Pointer to modulus value n (Array of operand_size_byte elements) */
  const uint8_t *p_phi;             /*!< Pointer to Phi value                                             */
} hal_pka_mod_exp_protect_config_t;

/**
  * @brief PKA Modular exponentiation (fast) configuration structure definition
  */
typedef struct
{
  uint32_t      exponent_size_byte;  /*!< Number of elements in p_exponent and p_montgomery_param arrays           */
  uint32_t      operand_size_byte;   /*!< Number of elements in p_operand and p_modulus arrays                     */
  const uint8_t *p_exponent;         /*!< Pointer to Exponent (Array of exponent_size_byte elements)               */
  const uint8_t *p_operand;          /*!< Pointer to Operand (Array of operand_size_byte elements)                 */
  const uint8_t *p_modulus;          /*!< Pointer to modulus (Array of operand_size_byte elements)                 */
  const uint8_t *p_montgomery_param; /*!< Pointer to Montgomery parameter (Array of exponent_size_byte elements)   */
} hal_pka_mod_exp_fast_config_t;

/**
  * @brief PKA Montgomery parameter computation configuration structure definition
  */
typedef struct
{
  uint32_t      size_byte;  /*!< Number of elements in p_operand array            */
  const uint8_t *p_operand; /*!< Pointer to Operand (Array of size_byte elements) */
} hal_pka_montgomery_config_t;

/**
  * @brief PKA Arithmetic configuration structure definition
  */
typedef struct
{
  uint32_t      size_byte;    /*!< Number of elements in p_operand_1 and p_operand_2 arrays */
  const uint8_t *p_operand_1; /*!< Pointer to Operand 1 (Array of size_byte elements)      */
  const uint8_t *p_operand_2; /*!< Pointer to Operand 2 (Array of size_byte elements)      */
} hal_pka_add_config_t, hal_pka_sub_config_t, hal_pka_mul_config_t, hal_pka_cmp_config_t;

/**
  * @brief PKA Modular inversion configuration structure definition
  */
typedef struct
{
  uint32_t      size_byte;  /*!< Number of elements in p_operand and p_modulus arrays     */
  const uint8_t *p_operand; /*!< Pointer to Operand (Array of size_byte elements)         */
  const uint8_t *p_modulus; /*!< Pointer to modulus value n (Array of size_byte elements) */
} hal_pka_mod_inv_config_t;

/**
  * @brief PKA Modular reduction configuration structure definition
  */
typedef struct
{
  uint32_t      operand_size_byte; /*!< Number of elements in p_operand array                            */
  uint32_t      modulus_size_byte; /*!< Number of elements in p_modulus array                            */
  const uint8_t *p_operand;        /*!< Pointer to Operand (Array of operand_size_byte elements)         */
  const uint8_t *p_modulus;        /*!< Pointer to modulus value n (Array of modulus_size_byte elements) */
} hal_pka_mod_red_config_t;

/**
  * @brief PKA Modular arithmetic configuration structure definition
  */
typedef struct
{
  uint32_t      size_byte;    /*!< Number of elements in p_operand_1 and p_operand_2 arrays */
  const uint8_t *p_operand_1; /*!< Pointer to Operand 1 (Array of size_byte elements)      */
  const uint8_t *p_operand_2; /*!< Pointer to Operand 2 (Array of size_byte elements)      */
  const uint8_t *p_operand_3; /*!< Pointer to Operand 3 (Array of size_byte elements)      */
} hal_pka_mod_add_config_t, hal_pka_mod_sub_config_t, hal_pka_montgomery_mul_config_t;

/**
  * @brief PKA ECC double base ladder configuration structure definition
  */
typedef struct
{
  uint32_t      prime_order_size_byte; /*!< Curve prime order n length                           */
  uint32_t      modulus_size_byte;     /*!< Curve modulus p length                               */
  uint32_t      coeff_sign;            /*!< Curve coefficient a sign                             */
  const uint8_t *p_coeff_a;            /*!< Pointer to curve coefficient |a|                     */
  const uint8_t *p_modulus;            /*!< Pointer to curve modulus value p                     */
  const uint8_t *p_integer_k;          /*!< Pointer to cryptographically secure random integer k */
  const uint8_t *p_integer_m;          /*!< Pointer to cryptographically secure random integer m */
  const uint8_t *p_base_pt_x_1;        /*!< Pointer to curve base first point coordinate x       */
  const uint8_t *p_base_pt_y_1;        /*!< Pointer to curve base first point coordinate y       */
  const uint8_t *p_base_pt_z_1;        /*!< Pointer to curve base first point coordinate z       */
  const uint8_t *p_base_pt_x_2;        /*!< Pointer to curve base second point coordinate x      */
  const uint8_t *p_base_pt_y_2;        /*!< Pointer to curve base second point coordinate y      */
  const uint8_t *p_base_pt_z_2;        /*!< Pointer to curve base second point coordinate z      */
} hal_pka_ecc_double_base_ladder_config_t;

/**
  * @brief PKA ECC projective to affine configuration structure definition
  */
typedef struct
{
  uint32_t      modulus_size_byte;   /*!< Curve modulus p length                       */
  const uint8_t *p_modulus;          /*!< Pointer to curve modulus value p             */
  const uint8_t *p_base_pt_x;        /*!< Pointer to curve base point coordinate x     */
  const uint8_t *p_base_pt_y;        /*!< Pointer to curve base point coordinate y     */
  const uint8_t *p_base_pt_z;        /*!< Pointer to curve base point coordinate z     */
  const uint8_t *p_montgomery_param; /*!< Pointer to Montgomery parameter R2 modulus n */
} hal_pka_ecc_projective_to_affine_config_t;

/**
  * @brief PKA ECC complete addition configuration structure definition
  */
typedef struct
{
  uint32_t      modulus_size_byte; /*!< Curve modulus p length                          */
  uint32_t      coeff_sign;        /*!< Curve coefficient a sign                        */
  const uint8_t *p_modulus;        /*!< Pointer to curve modulus value p                */
  const uint8_t *p_coeff_a;        /*!< Pointer to curve coefficient |a|                */
  const uint8_t *p_base_pt_x_1;    /*!< Pointer to curve base first point coordinate x  */
  const uint8_t *p_base_pt_y_1;    /*!< Pointer to curve base first point coordinate y  */
  const uint8_t *p_base_pt_z_1;    /*!< Pointer to curve base first point coordinate z  */
  const uint8_t *p_base_pt_x_2;    /*!< Pointer to curve base second point coordinate x */
  const uint8_t *p_base_pt_y_2;    /*!< Pointer to curve base second point coordinate y */
  const uint8_t *p_base_pt_z_2;    /*!< Pointer to curve base second point coordinate z */
} hal_pka_ecc_complete_add_config_t;

/**
  * @brief PKA output ECC complete addition structure definition
  */
typedef struct
{
  uint8_t *p_pt_x; /*!< Pointer to point P coordinate xP */
  uint8_t *p_pt_y; /*!< Pointer to point P coordinate yP */
  uint8_t *p_pt_z; /*!< Pointer to point P coordinate zP */
} hal_pka_ecc_complete_add_result_t;

