MaJerle/stm32-usart-uart-dma-rx-tx/drivers/STM32C5xx_drivers/hal/stm32c5xx_hal_pka.h
typedef struct hal_pka_handle_s hal_pka_handle_t; /*!< PKA Handle Structure type */
#if defined(USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1U)
typedef void (*hal_pka_cb_t)(hal_pka_handle_t *hpka); /*!< PKA Callback pointer definition */
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */

/**
  * @brief PKA handle Structure definition
  */
struct hal_pka_handle_s
{
  hal_pka_t                instance;            /*!< PKA register base address     */
  volatile hal_pka_state_t global_state;        /*!< PKA state                     */
  uint32_t                 operation;           /*!< PKA operating mode            */
#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1U)
  volatile uint32_t        last_error_codes;    /*!< PKA last error codes          */
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */
#if defined(USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1U)
  hal_pka_cb_t             p_operation_cplt_cb; /*!< PKA End of operation callback */
  hal_pka_cb_t             p_error_cb;          /*!< PKA Last error callback       */
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */
#if defined(USE_HAL_PKA_USER_DATA) && (USE_HAL_PKA_USER_DATA == 1U)
  const void               *p_user_data;        /*!< PKA user data                 */
#endif /* USE_HAL_PKA_USER_DATA */
};

/**
  * @}
  */

/* Exported functions ------------------------------------------------------------------------------------------------*/
/** @defgroup PKA_Exported_Functions HAL PKA Functions
  * @{
  */

/** @defgroup PKA_Exported_Functions_Group1 Initialization and deinitialization functions
  * @{
  */
/* Initialization and deinitialization functions */
hal_status_t HAL_PKA_Init(hal_pka_handle_t *hpka, hal_pka_t instance);
void         HAL_PKA_DeInit(hal_pka_handle_t *hpka);
/**
  * @}
  */

/** @defgroup PKA_Exported_Functions_Group2 Configuration functions
  * @{
  */
/* PKA arithmetic and modular configuration functions  */
hal_status_t HAL_PKA_SetConfigModExp(hal_pka_handle_t *hpka, const hal_pka_mod_exp_config_t *p_config);
hal_status_t HAL_PKA_SetConfigModExpFast(hal_pka_handle_t *hpka, const hal_pka_mod_exp_fast_config_t *p_config);
hal_status_t HAL_PKA_SetConfigModExpProtect(hal_pka_handle_t *hpka, const hal_pka_mod_exp_protect_config_t *p_config);
hal_status_t HAL_PKA_SetConfigAdd(hal_pka_handle_t *hpka, const hal_pka_add_config_t *p_config);
hal_status_t HAL_PKA_SetConfigSub(hal_pka_handle_t *hpka, const hal_pka_sub_config_t *p_config);
hal_status_t HAL_PKA_SetConfigCmp(hal_pka_handle_t *hpka, const hal_pka_cmp_config_t *p_config);
hal_status_t HAL_PKA_SetConfigMul(hal_pka_handle_t *hpka, const hal_pka_mul_config_t *p_config);
hal_status_t HAL_PKA_SetConfigModAdd(hal_pka_handle_t *hpka, const hal_pka_mod_add_config_t *p_config);
hal_status_t HAL_PKA_SetConfigModSub(hal_pka_handle_t *hpka, const hal_pka_mod_sub_config_t *p_config);
hal_status_t HAL_PKA_SetConfigModInv(hal_pka_handle_t *hpka, const hal_pka_mod_inv_config_t *p_config);
hal_status_t HAL_PKA_SetConfigModRed(hal_pka_handle_t *hpka, const hal_pka_mod_red_config_t *p_config);
hal_status_t HAL_PKA_SetConfigMontgomeryMul(hal_pka_handle_t *hpka, const hal_pka_montgomery_mul_config_t *p_config);
hal_status_t HAL_PKA_SetConfigMontgomery(hal_pka_handle_t *hpka, const hal_pka_montgomery_config_t *p_config);
/* PKA RSA configuration functions */
hal_status_t HAL_PKA_RSA_SetConfigCRTExp(hal_pka_handle_t *hpka, const hal_pka_rsa_crt_exp_config_t *p_config);
hal_status_t HAL_PKA_RSA_SetConfigSignature(hal_pka_handle_t *hpka, const hal_pka_rsa_signature_config_t *p_config);
hal_status_t HAL_PKA_RSA_SetConfigSignatureFast(hal_pka_handle_t *hpka,
                                                const hal_pka_rsa_signature_fast_config_t *p_config);
hal_status_t HAL_PKA_RSA_SetConfigSignatureProtect(hal_pka_handle_t *hpka,
                                                   const hal_pka_rsa_signature_protect_config_t *p_config);
hal_status_t HAL_PKA_RSA_SetConfigVerifSignature(hal_pka_handle_t *hpka, const hal_pka_rsa_verif_config_t *p_config);
/* PKA ECDSA configuration functions */
hal_status_t HAL_PKA_ECDSA_SetConfigSignatureProtect(hal_pka_handle_t *hpka,
                                                     const hal_pka_ecdsa_signature_protect_config_t *p_config);
hal_status_t HAL_PKA_ECDSA_SetConfigVerifSignature(hal_pka_handle_t *hpka,
                                                   const hal_pka_ecdsa_verif_config_t *p_config);
/* PKA ECC configuration functions */
hal_status_t HAL_PKA_ECC_SetConfigPointCheck(hal_pka_handle_t *hpka, const hal_pka_point_check_config_t *p_config);
hal_status_t HAL_PKA_ECC_SetConfigMulProtect(hal_pka_handle_t *hpka, const hal_pka_ecc_mul_protect_config_t *p_config);
hal_status_t HAL_PKA_ECC_SetConfigDoubleBaseLadder(hal_pka_handle_t *hpka,
                                                   const hal_pka_ecc_double_base_ladder_config_t *p_config);
hal_status_t HAL_PKA_ECC_SetConfigProjectiveToAffine(hal_pka_handle_t *hpka,
                                                     const hal_pka_ecc_projective_to_affine_config_t *p_config);
hal_status_t HAL_PKA_ECC_SetConfigCompleteAdd(hal_pka_handle_t *hpka,
                                              const hal_pka_ecc_complete_add_config_t *p_config);
/**
  * @}
  */

/** @defgroup PKA_Exported_Functions_Group3 Process management functions
  * @{
  */
hal_status_t HAL_PKA_Compute(hal_pka_handle_t *hpka, uint32_t timeout_ms);
hal_status_t HAL_PKA_Compute_IT(hal_pka_handle_t *hpka);
void         HAL_PKA_IRQHandler(hal_pka_handle_t *hpka);
hal_status_t HAL_PKA_Abort(hal_pka_handle_t *hpka);
/* PKA arithmetic and modular get result functions */
uint32_t HAL_PKA_GetResultModExp(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultModExpFast(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultModExpProtect(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultAdd(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultSub(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultCmp(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultMul(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultModAdd(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultModSub(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultModInv(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultModRed(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultMontgomeryMul(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t HAL_PKA_GetResultMontgomery(hal_pka_handle_t *hpka, uint8_t *p_result);
/* PKA RSA get result functions */
uint32_t                      HAL_PKA_RSA_GetResultCRTExp(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t                      HAL_PKA_RSA_GetResultSignature(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t                      HAL_PKA_RSA_GetResultSignatureFast(hal_pka_handle_t *hpka, uint8_t *p_result);
uint32_t                      HAL_PKA_RSA_GetResultSignatureProtect(hal_pka_handle_t *hpka, uint8_t *p_result);
hal_pka_rsa_signature_status_t HAL_PKA_RSA_IsValidVerifSignature(hal_pka_handle_t *hpka, const uint8_t *p_hash);
/* PKA ECDSA get result functions */
uint32_t HAL_PKA_ECDSA_GetResultSignatureProtect(hal_pka_handle_t *hpka,
                                                 hal_pka_ecdsa_signature_protect_result_t *p_result,
                                                 hal_pka_ecdsa_signature_result_ext_config_t *p_result_ext);
hal_pka_ecdsa_signature_status_t HAL_PKA_ECDSA_IsValidVerifSignature(const hal_pka_handle_t *hpka);
/* PKA ECC get result functions */
hal_pka_ecc_point_status_t HAL_PKA_ECC_IsPointCheckOnCurve(const hal_pka_handle_t *hpka);
uint32_t                  HAL_PKA_ECC_GetResultMulProtect(hal_pka_handle_t *hpka,
                                                          hal_pka_ecc_mul_protect_result_t *p_result);
uint32_t                  HAL_PKA_ECC_GetResultDoubleBaseLadder(hal_pka_handle_t *hpka,
                                                                hal_pka_ecc_double_base_ladder_result_t *p_result);
uint32_t                  HAL_PKA_ECC_GetResultProjectiveToAffine(hal_pka_handle_t *hpka,
                                                                  hal_pka_ecc_projective_to_affine_result_t *p_result);
uint32_t                  HAL_PKA_ECC_GetResultCompleteAdd(hal_pka_handle_t *hpka,
                                                           hal_pka_ecc_complete_add_result_t *p_result);
/**
  * @}
  */

/** @defgroup PKA_Exported_Functions_Group4 Callback functions
  * @{
  */
void         HAL_PKA_OperationCpltCallback(hal_pka_handle_t *hpka);
void         HAL_PKA_ErrorCallback(hal_pka_handle_t *hpka);
#if defined(USE_HAL_PKA_REGISTER_CALLBACKS) && (USE_HAL_PKA_REGISTER_CALLBACKS == 1U)
hal_status_t HAL_PKA_RegisterOperationCpltCallback(hal_pka_handle_t *hpka, hal_pka_cb_t p_callback);
hal_status_t HAL_PKA_RegisterErrorCallback(hal_pka_handle_t *hpka, hal_pka_cb_t p_callback);
#endif /* USE_HAL_PKA_REGISTER_CALLBACKS */
/**
  * @}
  */

/** @defgroup PKA_Exported_Functions_Group5 State and Error functions
  * @{
  */
/* Peripheral State and Error functions */
hal_pka_state_t HAL_PKA_GetState(const hal_pka_handle_t *hpka);
#if defined(USE_HAL_PKA_GET_LAST_ERRORS) && (USE_HAL_PKA_GET_LAST_ERRORS == 1U)
uint32_t        HAL_PKA_GetLastErrorCodes(const hal_pka_handle_t *hpka);
#endif /* USE_HAL_PKA_GET_LAST_ERRORS */
#if defined(USE_HAL_PKA_USER_DATA) && (USE_HAL_PKA_USER_DATA == 1U)
void            HAL_PKA_SetUserData(hal_pka_handle_t *hpka, const void *p_user_data);
const void      *HAL_PKA_GetUserData(const hal_pka_handle_t *hpka);
#endif /* USE_HAL_PKA_USER_DATA */
/**
  * @}
  */

/** @defgroup PKA_Exported_Functions_Group6 PKA RAM Mass Erase function
  * @{
  */
hal_status_t HAL_PKA_RAMMassErase(hal_pka_handle_t *hpka);
/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* PKA */
/**
  * @}
  */

#ifdef __cplusplus
}
#endif /* __cplusplus */

#endif /* STM32C5XX_HAL_PKA_H */
